//
//  common.swift
//  UI
//
//  Created by hzy on 2020/05/30
//  Copyright © 2020 zys All rights reserved.
//

import UIKit

var title1 = "swift入门"
var title2 = "swift进阶"
var detial = "456"
var price = "¥0.99"
var stock:Int = 10
var bookTypeNumber = 10
var number = [1,2,3,4,5,6,7,8,9,10]
var bookOfNumber = ["","","","","","","","","","",]
var titleMessage = ["白夜行","解忧杂货店","嫌疑人x的献身","三体1","狼图腾","重返狼群","重返狼群2","兄弟","三国演义","挪威的森林"]
var detialMessage = ["一天当中，有太阳升起的时候，也有下沉的时候。人生也一样，有白天和黑夜，只是不会像真正的太阳那样，有定时的日出和日落。看个人，有些人一辈子都活在太阳的照耀下，也有些人不得不一直活在漆黑的深夜里。人害怕的，就是本来一直存在的太阳落下不再升起，也就是非常害怕原本照在身上的光芒消失。我的天空里没有太阳，总是黑夜，但并不暗，因为有东西代替了太阳。虽然没有太阳那么明亮，但对我来说已经足够。凭借着这份光，我便能把黑夜当成白天。你明白吗？我从来就没有太阳，所以不怕失去。","如果说，来找我咨询烦恼的人是迷途的羔羊，通常他们手上都有地图，却没有看地图，或是不知道自己目前的位置。 但我相信你不属于任何一种情况，你画的地图是一张白纸，所以，即使想决定目的地，也不知道路在哪里。 地图是白纸当然很伤脑筋，任何人都会布置所措。但是不妨换一个角度思考，正因为是白纸，所以可以画任何地图，一切都掌握在你自己手上。你很自由，充满了无限可能。这是很棒的事，我衷心祈祷你可以相信自己，无悔地燃烧自己","你我都不可能摆脱时钟的束缚，彼此都已沦为社会这个时钟的齿轮。一旦少了齿轮，时钟就会出乱子。纵然渴望率性而为，周遭也不容许。我们虽然得到了安定，但失去自由也是不争的事实。在游民当中，应该有不少人不想回到原来的生活。 这个世界上没有无用的齿轮，只有齿轮自身才能决定自己的用途。","无限长的曲线就是宇宙的抽象，一头连着无限的过去，另一头连着无限的未来，中间只有无规律无生命的随机起伏，一个个高低错落的波峰就像一粒粒大小不等的沙子，整条曲线就像是所有沙粒排成行形成的一维沙漠，荒凉寂寥，长得更令人无法忍受。你可以沿着它向前向后走无限远，但永远找不到归宿。","青陈阵来到内蒙古额仑草原插队。在草原上，他钻狼洞，掏狼崽，养小狼，与他的小狼共患难，和狼结下了不解之缘。蒙古狼带他穿过历史的千年迷雾，慢慢地，他懂得了为什么蒙古人会如此信奉狼图腾，还有草原人对狼的爱和恨……","2010年4月，若尔盖草原，女画家李微漪救下奄奄一息的小狼崽'格林'，带回成都喂养。两个半月以后，繁华城市中不再有一匹狼的容身之地。看着格林孤独迷茫的样子，她决定带它回归真正的家园。然而，由人类抚养长大的狼，是不被野生狼群接受的。她陪着格林，从zui简单的狩猎开始，一步步教给它莽莽荒原的生存法则。直到有一天，在历经险恶环境的生死考验之后，她才发现自己已然成为格林的负担。","众多读者心系格林命运，期待能从作者李微漪那里获知格林返回狼群后的近况。李微漪离别草原两年后，为了格林再返狼山，经过九死一生，几次遭遇盗猎者，险些亡命，终于找到格林。","讲述了江南小镇两兄弟李光头和宋钢的人生。李光头的父亲不怎么光彩地意外身亡，而同一天李光头出生。宋钢的父亲宋凡平在众人的嘲笑声中挺身而出，帮助了李光头的母亲李兰，被后者视为恩人。几年后宋钢的母亲也亡故，李兰和宋凡平在互相帮助中相爱并结婚。虽然这场婚姻遭到了镇上人们的鄙夷和嘲弄，但两人依然相爱甚笃，而李光头和宋钢这对没有血缘关系的兄弟也十分投缘，他们在相互照顾中成长…… 本书荣获法国国际信使外国小说奖（2008年），入选瑞士《时报》2000年至2010年这10年来全球*为重要的15本书。","北海孔融，字文举，鲁国曲阜人也，孔子二十世孙，泰山都尉孔宙之子。自小聪明，年十岁时，往谒河南尹李膺，阍人难之，融曰：“我系李相通家。”及入见，膺问曰：“汝祖与吾祖何亲？”融曰：“昔孔子曾问礼于老子，融与君岂非累世通家？”膺大奇之。少顷，太中大夫陈炜至。膺指融曰：“此奇童也。”炜曰：“小时聪明，大时未必聪明。”融即应声曰：“如君所言，幼时必聪明者。”炜等皆笑曰：“此子长成，必当代之伟器也。”自此得名。后为中郎将，累迁北海太守。极好宾客，常曰：“座上客常满，樽中酒不空：吾之愿也。","《挪威的森林》是日本作家村上春树所著的一部长篇爱情小说，影响了几代读者的青春名作。故事讲述主角渡边纠缠在情绪不稳定且患有精神疾病的直子和开朗活泼的小林绿子之间，苦闷彷徨，*终展开了自我救赎和成长的旅程。彻头彻尾的现实笔法，描绘了逝去的青春风景，小说中弥散着特有的感伤和孤独气氛。"]
var isAddCartMessage = [String](repeating: "0", count: stock)
var isAdd = 0


var dict:[String:String] = [:]
var arrImage = [UIImage]()

func bookOfMessage(){
    for i in 0..<bookTypeNumber {
        bookOfNumber[i] = "0000" + String(number[i])
        arrImage.append(UIImage(named: "b\(i)")!)
        if i <= 4{
            var title = title1 + String(i)
            dict = ["num":bookOfNumber[i],"title":titleMessage[i],"detial":detialMessage[i],"price":price,"stock":String(stock),"isAddCart":isAddCartMessage[i]]
            titleMessage[i] = dict["title"]!
            detialMessage[i] = "简介：" + dict["detial"]!
//            isAddCartMessage[i] = dict["isAddCart"]!
        }
        else{
            var title = title2 + String(i)
            dict = ["num":bookOfNumber[i],"title":titleMessage[i],"detial":detialMessage[i],"price":price,"stock":String(stock),"isAddCart":isAddCartMessage[i]]
            titleMessage[i] = dict["title"]!
            detialMessage[i] = "简介：" + dict["detial"]!
//            isAddCartMessage[i] = dict["isAddCart"]!
//            print(detialMessage[i])
        }
//        print(isAddCartMessage[i])
    }
}



